apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc178x_40xx_syscon.h
#define LPC17_40_SYSCON_FLASHCFG            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_FLASHCFG_OFFSET)

/* Memory Mapping Control register (MEMMAP - 0x400F C040) */

#define LPC17_40_SYSCON_MEMMAP              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_MEMMAP_OFFSET)

/* Clocking and power control - Phase locked loops */

#define LPC17_40_SYSCON_PLL0CON             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL0CON_OFFSET)
#define LPC17_40_SYSCON_PLL0CFG             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL0CFG_OFFSET)
#define LPC17_40_SYSCON_PLL0STAT            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL0STAT_OFFSET)
#define LPC17_40_SYSCON_PLL0FEED            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL0FEED_OFFSET)

#define LPC17_40_SYSCON_PLL1CON             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL1CON_OFFSET)
#define LPC17_40_SYSCON_PLL1CFG             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL1CFG_OFFSET)
#define LPC17_40_SYSCON_PLL1STAT            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL1STAT_OFFSET)
#define LPC17_40_SYSCON_PLL1FEED            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PLL1FEED_OFFSET)

/* Clocking and power control - Peripheral power control registers */

#define LPC17_40_SYSCON_PCON                (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PCON_OFFSET)
#define LPC17_40_SYSCON_PCONP               (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PCONP_OFFSET)
#define LPC17_40_SYSCON_PCONP1              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PCONP1_OFFSET)

/* Clocking and power control -- Clock dividers */

#define LPC17_40_SYSCON_EMCCLKSEL           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EMCCLKSEL_OFFSET)
#define LPC17_40_SYSCON_CCLKSEL             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_CCLKSEL_OFFSET)
#define LPC17_40_SYSCON_USBCLKSEL           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_USBCLKSEL_OFFSET)

/* 0x400f c110 - 0x400f c114: CAN Wake and Sleep Registers */

/* Clocking and power control -- Clock source selection */

#define LPC17_40_SYSCON_CLKSRCSEL           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_CLKSRCSEL_OFFSET)
#define LPC17_40_SYSCON_CANSLEEPCLR         (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_CANSLEEPCLR_OFFSET)
#define LPC17_40_SYSCON_CANWAKEFLAGS        (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_CANWAKEFLAGS_OFFSET)

/* System control registers -- External Interrupts */

#define LPC17_40_SYSCON_EXTINT              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EXTINT_OFFSET)

#define LPC17_40_SYSCON_EXTMODE             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EXTMODE_OFFSET)
#define LPC17_40_SYSCON_EXTPOLAR            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EXTPOLAR_OFFSET)

/* System control registers -- Reset */

#define LPC17_40_SYSCON_RSID                (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_RSID_OFFSET)

/* System control registers -- Syscon Miscellaneous Registers */

#define LPC17_40_SYSCON_MATRIXARB           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_MATRIXARB_OFFSET)
#define LPC17_40_SYSCON_SCS                 (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_SCS_OFFSET)
#define LPC17_40_SYSCON_PCLKSEL             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PCLKSEL_OFFSET)
#define LPC17_40_SYSCON_PBOOST              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_PBOOST_OFFSET)
#define LPC17_40_SYSCON_SPIFICLKSEL         (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_SPIFICLKSEL_OFFSET)
#define LPC17_40_SYSCON_LCDCFG              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_LCDCFG_OFFSET)

/* Device Interrupt Registers (Might be a error in the User Manual, might be at 0x5000c1c0) */

#define LPC17_40_SYSCON_USBINTST            (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_USBINTST_OFFSET)

/* DMA Request Select Register */

#define LPC17_40_SYSCON_DMAREQSEL           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_DMAREQSEL_OFFSET)

/* More clocking and power control -- Utility */

#define LPC17_40_SYSCON_CLKOUTCFG           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_CLKOUTCFG_OFFSET)


/* Peripheral Reset Control */

#define LPC17_40_SYSCON_RSTCON0             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_RSTCON0_OFFSET)
#define LPC17_40_SYSCON_RSTCON1             (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_RSTCON1_OFFSET)

/* EMC Clock Control and Calibration */

#define LPC17_40_SYSCON_EMCDLYCTL           (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EMCDLYCTL_OFFSET)
#define LPC17_40_SYSCON_EMCCAL              (LPC17_40_SYSCON_BASE+LPC17_40_SYSCON_EMCCAL_OFFSET)

/* Register bit definitions *************************************************************************/
/* Flash accelerator module */
                                                         /* Bits 0-11:  Reserved */
#define SYSCON_FLASHCFG_TIM_SHIFT           (12)         /* Bits 12-15: FLASHTIM Flash access time */
#define SYSCON_FLASHCFG_TIM_MASK            (15 << SYSCON_FLASHCFG_TIM_SHIFT)
#  define SYSCON_FLASHCFG_TIM_0             (0)                              /* 1 CPU clock <= 20 MHz CPU clock */
#  define SYSCON_FLASHCFG_TIM_1             (1 << SYSCON_FLASHCFG_TIM_SHIFT) /* 2 CPU clock <= 40 MHz CPU clock */
#  define SYSCON_FLASHCFG_TIM_2             (2 << SYSCON_FLASHCFG_TIM_SHIFT) /* 3 CPU clock <= 60 MHz CPU clock */
#  define SYSCON_FLASHCFG_TIM_3             (3 << SYSCON_FLASHCFG_TIM_SHIFT) /* 4 CPU clock <= 80 MHz CPU clock */
#  define SYSCON_FLASHCFG_TIM_4             (4 << SYSCON_FLASHCFG_TIM_SHIFT) /* 5 CPU clock <= 100 MHz CPU clock
                                                                              * (Up to 120 Mhz for LPC1788x) */
#  define SYSCON_FLASHCFG_TIM_5             (5 << SYSCON_FLASHCFG_TIM_SHIFT) /* "safe" setting for any conditions */
                                                      /* Bits 16-31:  Reserved */
/* Memory Mapping Control register (MEMMAP - 0x400F C040) */

#define SYSCON_MEMMAP_MAP                   (1 << 0)  /* Bit 0:
                                                       * 0:Boot mode. A portion of the Boot ROM is mapped to address 0.
                                                       * 1:User mode. The on-chip Flash memory is mapped to address 0 */
                                                      /* Bits 1-31:  Reserved */
/* Clocking and power control -- Clock source selection */

#define SYSCON_CLKSRCSEL_SHIFT              (0)       /* Bits 0: Clock selection */
#define SYSCON_CLKSRCSEL_MASK               (1 << SYSCON_CLKSRCSEL_SHIFT)
#  define SYSCON_CLKSRCSEL_INTRC            (0 << SYSCON_CLKSRCSEL_SHIFT) /* PLL0 source = internal RC oscillator */
#  define SYSCON_CLKSRCSEL_MAIN             (1 << SYSCON_CLKSRCSEL_SHIFT) /* PLL0 source = main oscillator */
                                                      /* Bits 1-31:  Reserved */
/* Clocking and power control - Phase locked loops */
/* PLL0/1 Control register */

#define SYSCON_PLLCON_PLLE                  (1 << 0)  /* Bit 0: PLL Enable */
                                                      /* Bits 1-31:  Reserved */
/* PLL0/1 Configuration register */

#define SYSCON_PLLCFG_MSEL_SHIFT            (0)       /* Bit 0-4: PLL Multiplier value */
#define SYSCON_PLLCFG_MSEL_MASK             (0x1f << SYSCON_PLLCFG_MSEL_SHIFT)
#define SYSCON_PLLCFG_PSEL_SHIFT            (5)       /* Bit 5-6: PLL Pre-Divider value */
#define SYSCON_PLLCFG_PSEL_MASK             (3 << SYSCON_PLLCFG_PSEL_SHIFT)

/* PLL0/1 Status register */

