apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc178x_40xx_syscon.h
#define SYSCON_CLKOUTCFG_SEL_SHIFT          (0)       /* Bits 0-3: Selects clock source for CLKOUT */
#define SYSCON_CLKOUTCFG_SEL_MASK           (15 << SYSCON_CLKOUTCFG_SEL_SHIFT)
#  define SYSCON_CLKOUTCFG_SEL_CPU          (0 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=CPU clock */
#  define SYSCON_CLKOUTCFG_SEL_MAIN         (1 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=main osc */
#  define SYSCON_CLKOUTCFG_SEL_INTRC        (2 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=internal RC osc */
#  define SYSCON_CLKOUTCFG_SEL_USB          (3 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=USB clock */
#  define SYSCON_CLKOUTCFG_SEL_RTC          (4 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=RTC osc */
#  define SYSCON_CLKOUTCFG_SEL_SPIFI        (5 << SYSCON_CLKOUTCFG_SEL_SHIFT) /* CLKOUT source=SPIFI osc */
#define SYSCON_CLKOUTCFG_DIV_SHIFT          (4)       /* Bits 4-7:  CLKOUT divisor */
#define SYSCON_CLKOUTCFG_DIV_MASK           (15 << SYSCON_CLKOUTCFG_DIV_SHIFT)
#  define SYSCON_CLKOUTCFG_DIV(n)           ((n-1) << SYSCON_CLKOUTCFG_DIV_SHIFT) /* n=1..16 */
#define SYSCON_CLKOUTCFG_EN                 (1 << 8)  /* Bit 8:  CLKOUT enable control */
#define SYSCON_CLKOUTCFG_ACT                (1 << 9)  /* Bit 9:  CLKOUT activity indication */
                                                      /* Bits 10-31: Reserved */
/* System control registers -- External Interrupts */
/* External Interrupt Flag register */

#define SYSCON_EXTINT_EINT0                 (1 << 0)  /* Bit 0:  EINT0 */
#define SYSCON_EXTINT_EINT1                 (1 << 1)  /* Bit 1:  EINT1 */
#define SYSCON_EXTINT_EINT2                 (1 << 2)  /* Bit 2:  EINT2 */
#define SYSCON_EXTINT_EINT3                 (1 << 3)  /* Bit 3:  EINT3 */
                                                      /* Bits 4-31: Reserved */
/* External Interrupt Mode register */

#define SYSCON_EXTMODE_EINT0                (1 << 0)  /* Bit 0:  1=EINT0 edge sensitive */
#define SYSCON_EXTMODE_EINT1                (1 << 1)  /* Bit 1:  1=EINT1 edge sensitive */
#define SYSCON_EXTMODE_EINT2                (1 << 2)  /* Bit 2:  1=EINT2 edge sensitive */
#define SYSCON_EXTMODE_EINT3                (1 << 3)  /* Bit 3:  1=EINT3 edge sensitive */
                                                      /* Bits 4-31: Reserved */
/* External Interrupt Polarity register */

#define SYSCON_EXTPOLAR_EINT0               (1 << 0)  /* Bit 0:  1=EINT0 high active/rising edge */
#define SYSCON_EXTPOLAR_EINT1               (1 << 1)  /* Bit 1:  1=EINT1 high active/rising edge */
#define SYSCON_EXTPOLAR_EINT2               (1 << 2)  /* Bit 2:  1=EINT2 high active/rising edge */
#define SYSCON_EXTPOLAR_EINT3               (1 << 3)  /* Bit 3:  1=EINT3 high active/rising edge */
                                                      /* Bits 4-31: Reserved */
/* System control registers -- Reset */
/* Reset Source Identification Register */

#define SYSCON_RSID_POR                     (1 << 0)  /* Bit 0:  Power on reset */
#define SYSCON_RSID_EXTR                    (1 << 1)  /* Bit 1:  external RESET signal */
#define SYSCON_RSID_WDTR                    (1 << 2)  /* Bit 2:  Watchdog Timer time out w/WDTRESET */
#define SYSCON_RSID_BODR                    (1 << 3)  /* Bit 3:  Brown out detection */
#define SYSCON_RSID_SYSRESET                (1 << 4)  /* Bit 4:  System Reset */
#define SYSCON_RSID_LOCKUP                  (1 << 5)  /* Bit 5:  Lockup Reset */
                                                      /* Bits 6-31: Reserved */
/* System control registers -- Matrix Arbitration Priorities */

# define SYSCON_MATRIXARB_PRI_LOWEST        (0)
# define SYSCON_MATRIXARB_PRI_LOW           (1)
# define SYSCON_MATRIXARB_PRI_HIGH          (2)
# define SYSCON_MATRIXARB_PRI_HIGHEST       (3)

#define SYSCON_MATRIXARB_PRI_ICODE_SHIFT    (0)       /* Bits 0-1:  I-Code bus priority (should be lower than D-Code) */
#define SYSCON_MATRIXARB_PRI_ICODE_MASK     (3 << SYSCON_MATRIXARB_PRI_ICODE_SHIFT)
#  define SYSCON_MATRIXARB_PRI_ICODE(n)     ((n) << SYSCON_MATRIXARB_PRI_ICODE_SHIFT)
#define SYSCON_MATRIXARB_PRI_DCODE_SHIFT    (2)       /* Bits 2-3:  D-Code bus priority */
#define SYSCON_MATRIXARB_PRI_DCODE_MASK     (3 << SYSCON_MATRIXARB_PRI_DCODE_SHIFT)
#  define SYSCON_MATRIXARB_PRI_DCODE(n)     ((n) << SYSCON_MATRIXARB_PRI_DCODE_SHIFT)
#define SYSCON_MATRIXARB_PRI_SYS_SHIFT      (4)       /* Bits 4-5:  System bus priority */
#define SYSCON_MATRIXARB_PRI_SYS_MASK       (3 << SYSCON_MATRIXARB_PRI_SYS_SHIFT)
#  define SYSCON_MATRIXARB_PRI_SYS(n)       ((n) << SYSCON_MATRIXARB_PRI_SYS_SHIFT)
#define SYSCON_MATRIXARB_PRI_GPDMA_SHIFT    (6)       /* Bits 6-7:  General Purpose DMA priority */
#define SYSCON_MATRIXARB_PRI_GPDMA_MASK     (3 << SYSCON_MATRIXARB_PRI_GPDMA_SHIFT)
#  define SYSCON_MATRIXARB_PRI_GPDMA(n)     ((n) << SYSCON_MATRIXARB_PRI_GPDMA_SHIFT)
#define SYSCON_MATRIXARB_PRI_ETH_SHIFT      (8)       /* Bits 8-9:  Ethernet DMA priority */
#define SYSCON_MATRIXARB_PRI_ETH_MASK       (3 << SYSCON_MATRIXARB_PRI_ETH_SHIFT)
#  define SYSCON_MATRIXARB_PRI_ETH(n)       ((n) << SYSCON_MATRIXARB_PRI_ETH_SHIFT)
#define SYSCON_MATRIXARB_PRI_LCD_SHIFT      (10)      /* Bits 10-11:  LCD DMA priority */
#define SYSCON_MATRIXARB_PRI_LCD_MASK       (3 << SYSCON_MATRIXARB_PRI_LCD_SHIFT)
#  define SYSCON_MATRIXARB_PRI_LCD(n)       ((n) << SYSCON_MATRIXARB_PRI_LCD_SHIFT)
#define SYSCON_MATRIXARB_PRI_USB_SHIFT      (12)      /* Bits 12-13:  USB DMA priority */
#define SYSCON_MATRIXARB_PRI_USB_MASK       (3 << SYSCON_MATRIXARB_PRI_USB_SHIFT)
#  define SYSCON_MATRIXARB_PRI_USB(n)       ((n) << SYSCON_MATRIXARB_PRI_USB_SHIFT)
                                                      /* Bits 14-15: Reserved */
#define SYSCON_MATRIXARB_ROM_LAT_SHIFT      (16)      /* Bit 16:  ROM Latency select (should always be zero) */
#define SYSCON_MATRIXARB_ROM_LAT            (1 << SYSCON_MATRIXARB_ROM_LAT_SHIFT)
                                                      /* Bits 17-31: Reserved */

#define SYSCON_MATRIXARB_PRI_MASK           (0x00013fff)

/* System control registers -- Syscon Miscellaneous Registers */

#define SYSCON_SCS_EMCSC                    (1 << 0)  /* Bit 0:  EMC shift control */
#define SYSCON_SCS_EMCRD                    (1 << 1)  /* Bit 1:  EMC reset disable */
#define SYSCON_SCS_EMCBC                    (1 << 2)  /* Bit 2:  EMC burst control */
#define SYSCON_SCS_MCIPWRAL                 (1 << 3)  /* Bit 3:  MCI power active level */
#define SYSCON_SCS_OSCRS                    (1 << 4)  /* Bit 4:  Main oscillator range select */
#define SYSCON_SCS_OSCEN                    (1 << 5)  /* Bit 5:  Main oscillator enable */
#define SYSCON_SCS_OSCSTAT                  (1 << 6)  /* Bit 6:  Main oscillator status */
                                                      /* Bits 7-31: Reserved */
/* Device Interrupt Registers */
/* USB Interrupt Status register */

