apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc178x_40xx_syscon.h
#define SYSCON_USBINTST_REQLP               (1 << 0)  /* Bit 0:  Low priority interrupt line status */
#define SYSCON_USBINTST_REQHP               (1 << 1)  /* Bit 1:  High priority interrupt line status */
#define SYSCON_USBINTST_REQDMA              (1 << 2)  /* Bit 2:  DMA interrupt line status */
#define SYSCON_USBINTST_HOSTINT             (1 << 3)  /* Bit 3:  USB host interrupt line status */
#define SYSCON_USBINTST_ATXINT              (1 << 4)  /* Bit 4:  External ATX interrupt line status */
#define SYSCON_USBINTST_OTGINT              (1 << 5)  /* Bit 5:  OTG interrupt line status */
#define SYSCON_USBINTST_I2CINT              (1 << 6)  /* Bit 6:  I2C module interrupt line status */
                                                      /* Bit 7:  Reserved */
#define SYSCON_USBINTST_NEEDCLK             (1 << 8)  /* Bit 8:  USB need clock indicator */
                                                      /* Bits 9-30: Reserved */
#define SYSCON_USBINTST_ENINTS              (1 << 31) /* Bit 31: Enable all USB interrupts */

/* DMA Request Select Register */

#define SYSCON_DMAREQSEL_INP0               (1 << 0)  /* Bit 0:  Input 0 0=unused 1=Timer 0 match 0 */
#define SYSCON_DMAREQSEL_INP1               (1 << 1)  /* Bit 1:  Input 1 0=SD 1=Timer 0 match 1 */
#define SYSCON_DMAREQSEL_INP2               (1 << 2)  /* Bit 2:  Input 2 0=SSP0 TX 1=Timer 1 match 0 */
#define SYSCON_DMAREQSEL_INP3               (1 << 3)  /* Bit 3:  Input 3 0=SSP0 RX 1=Timer 1 match 1 */
#define SYSCON_DMAREQSEL_INP4               (1 << 4)  /* Bit 4:  Input 4 0=SSP1 TX 1=Timer 2 match 0 */
#define SYSCON_DMAREQSEL_INP5               (1 << 5)  /* Bit 5:  Input 5 0=SSP1 RX 1=Timer 2 match 1 */
#define SYSCON_DMAREQSEL_INP6               (1 << 6)  /* Bit 6:  Input 6 0=SSP2 TX 1=I2S0 */
#define SYSCON_DMAREQSEL_INP7               (1 << 7)  /* Bit 7:  Input 7 0=SSP2 RX 1=I2S1 */
                                                      /* Bits 8-9: Reserved */
#define SYSCON_DMAREQSEL_INP10              (1 << 10) /* Bit 10:  Input 10 0=UART0 TX 1=UART3 TX */
#define SYSCON_DMAREQSEL_INP11              (1 << 11) /* Bit 11:  Input 11 0=UART0 RX 1=UART3 RX */
#define SYSCON_DMAREQSEL_INP12              (1 << 12) /* Bit 12:  Input 12 0=UART1 TX 1=UART4 TX */
#define SYSCON_DMAREQSEL_INP13              (1 << 13) /* Bit 13:  Input 13 0=UART1 RX 1=UART4 RX */
#define SYSCON_DMAREQSEL_INP14              (1 << 14) /* Bit 14:  Input 14 0=UART2 TX 1=Timer 3 match 0 */
#define SYSCON_DMAREQSEL_INP15              (1 << 15) /* Bit 15:  Input 15 0=UART2 RX 1=Timer 3 match 1 */
                                                      /* Bits 16-31: Reserved */
/* Reset Control Register 0 */

#define SYSCON_RSTCON0_RSTLCD               (1 << 0)  /* LCD controller reset control bit */
#define SYSCON_RSTCON0_RSTTIM0              (1 << 1)  /* Timer/Counter 0 reset control bit */
#define SYSCON_RSTCON0_RSTTIM1              (1 << 2)  /* Timer/Counter 1 reset control bit */
#define SYSCON_RSTCON0_RSTUART0             (1 << 3)  /* UART0 reset control bit */
#define SYSCON_RSTCON0_RSTUART1             (1 << 4)  /* UART1 reset control bit */
#define SYSCON_RSTCON0_RSTPWM0              (1 << 5)  /* PWM0 reset control bit */
#define SYSCON_RSTCON0_RSTPWM1              (1 << 6)  /* PWM1 reset control bit */
#define SYSCON_RSTCON0_RSTI2C0              (1 << 7)  /* The I2C0 interface reset control bit */
#define SYSCON_RSTCON0_RSTUART4             (1 << 8)  /* UART4 reset control bit */
#define SYSCON_RSTCON0_RSTRTC               (1 << 9)  /* RTC and Event Monitor/Recorder reset control bit. RTC reset is limited */
#define SYSCON_RSTCON0_RSTSSP1              (1 << 10) /* The SSP 1 interface reset control bit */
#define SYSCON_RSTCON0_RSTEMC               (1 << 11) /* External Memory Controller reset control bit */
#define SYSCON_RSTCON0_RSTADC               (1 << 12) /* A/D converter (ADC) reset control bit */
#define SYSCON_RSTCON0_RSTCAN1              (1 << 13) /* CAN Controller 1 reset control bit */
                                                      /* Note: The CAN acceptance filter may be reset by 0
                                                       * a separate bit in the RSTCON1 register. */
#define SYSCON_RSTCON0_RSTCAN2              (1 << 14) /* CAN Controller 2 reset control bit */
                                                      /* Note: The CAN acceptance filter may be reset by 0
                                                       * a separate bit in the RSTCON1 register */
#define SYSCON_RSTCON0_RSTGPIO              (1 << 15) /* Reset control bit for GPIO, and GPIO interrupts */
                                                      /* Note: IOCON may be reset by a 0
                                                       * separate bit in the RSTCON1 register */
#define SYSCON_RSTCON0_RSTSPIFI             (1 << 16) /* SPI Flash Interface reset control bit (LPC1773 only) */
#define SYSCON_RSTCON0_RSTMCPWM             (1 << 17) /* Motor Control PWM reset control bit */
#define SYSCON_RSTCON0_RSTQEI               (1 << 18) /* Quadrature Encoder Interface reset control bit */
#define SYSCON_RSTCON0_RSTI2C1              (1 << 19) /* The I2C1 interface reset control bit */
#define SYSCON_RSTCON0_RSTSSP2              (1 << 20) /* The SSP2 interface reset control bit */
#define SYSCON_RSTCON0_RSTSSP0              (1 << 21) /* The SSP0 interface reset control bit */
#define SYSCON_RSTCON0_RSTTIM2              (1 << 22) /* Timer 2 reset control bit */
#define SYSCON_RSTCON0_RSTTIM3              (1 << 23) /* Timer 3 reset control bit */
#define SYSCON_RSTCON0_RSTUART2             (1 << 24) /* UART 2 reset control bit */
#define SYSCON_RSTCON0_RSTUART3             (1 << 25) /* UART 3 reset control bit */
#define SYSCON_RSTCON0_RSTI2C2              (1 << 26) /* I2C2 interface reset control bit.*/
#define SYSCON_RSTCON0_RSTI2S               (1 << 27) /* I2S interface reset control bit */
#define SYSCON_RSTCON0_RSTSDC               (1 << 28) /* SD Card interface reset control bit */
#define SYSCON_RSTCON0_RSTGPDMA             (1 << 29) /* GPDMA function reset control bit */

#define SYSCON_RSTCON0_RSTENET              (1 << 30) /* Ethernet block reset control bit */
#define SYSCON_RSTCON0_RSTUSB               (1 << 31) /* USB interface reset control bit */

/* Reset Control Register 1 */

#define SYSCON_RSTCON1_RSTIOCON             (1 << 0) /* Reset control bit for the IOCON registers */
#define SYSCON_RSTCON1_RSTDAC               (1 << 1) /* D/A converter (DAC) reset control bit */
#define SYSCON_RSTCON1_RSTCANACC            (1 << 2) /* CAN acceptance filter reset control bit */
                                                     /* Bits 3-31: Reserved */
/* Delay Control Register - EMC */
                                                    /* Delay values multiplied by 250 picoseconds */
#define SYSCON_EMCDLYCTL_CMDDLY_SHIFT       (0)     /* Bits 0-4: Delay value for EMC outputs in command delayed mode */
#define SYSCON_EMCDLYCTL_CMDDLY_MASK        (0x1f << SYSCON_EMCDLYCTL_CMDDLY_SHIFT)
# define SYSCON_EMCDLYCTL_CMDDLY(n)         ((n-1) << SYSCON_EMCDLYCTL_CMDDLY_SHIFT) /* n = 3 - 32 */
                                                    /* Bits 5-7: Reserved */
#define SYSCON_EMCDLYCTL_FBCLKDLY_SHIFT     (8)     /* Bits 8-12: Delay value for the feedback clock that controls input data sampling */
#define SYSCON_EMCDLYCTL_FBCLKDLY_MASK      (0x1f << SYSCON_EMCDLYCTL_FBCLKDLY_SHIFT)
#define SYSCON_EMCDLYCTL_FBCLKDLY(n)        ((n-1)<< SYSCON_EMCDLYCTL_FBCLKDLY_SHIFT) /* n = 3 - 32 */
                                                    /* Bits 13-15: Reserved */
#define SYSCON_EMCDLYCTL_CLKOUT0DLY_SHIFT   (16)    /* Bits 16-20: Delay value for the CLKOUT0 output */
#define SYSCON_EMCDLYCTL_CLKOUT0DLY_MASK    (0x1f << SYSCON_EMCDLYCTL_CLKOUT0DLY_SHIFT)
# define SYSCON_EMCDLYCTL_CLKOUT0DLY(n)     ((n-1) << SYSCON_EMCDLYCTL_CLKOUT0DLY_SHIFT) /* n = 3 - 32 */
                                                    /* Bits 21-23: Reserved */
#define SYSCON_EMCDLYCTL_CLKOUT1DLY_SHIFT   (24)    /* Bits 24-28: Delay value for the CLKOUT1 output */
#define SYSCON_EMCDLYCTL_CLKOUT1DLY_MASK    (0x1f << SYSCON_EMCDLYCTL_CLKOUT1DLY_SHIFT)
# define SYSCON_EMCDLYCTL_CLKOUT1DLY(n)     ((n-1) << SYSCON_EMCDLYCTL_CLKOUT1DLY_SHIFT) /* n = 3 - 32 */
                                                    /* Bits 29-31: Reserved */
/* Calibration Register - EMC */

#define SYSCON_EMCCAL_CALVALUE_SHIFT        (0)      /* Bits 0-7: Ring oscillator count during 32 clocks of Internal RC */
#define SYSCON_EMCCAL_CALVALUE_MASK         (0xff << SYSCON_EMCCAL_CALVALUE_SHIFT)
                                                     /* Bits 8-13: Reserved */
#define SYSCON_EMCCAL_START_SHIFT           (14)     /* Bit 14: Start control bit for EMC calibration counter */
#define SYSCON_EMCCAL_START_MASK            (1 << SYSCON_EMCCAL_START_SHIFT)
#  define SYSCON_EMCCAL_START               (1)      /* Automatically cleared when measurement is done */
#define SYSCON_EMCCAL_DONE_SHIFT            (15)     /* Bit 15: Measurement completion flag bit */
#define SYSCON_EMCCAL_DONE_MASK             (1 << SYSCON_EMCCAL_DONE_SHIFT)
                                                     /* Automatically cleared when START bit is set */
                                                     /* Bits 16-31: Reserved */

/* Compatibility Definitions ************************************************************************/
/* Need in lpc17_40_clockconfig.h for compatibility with the LPC176x family: */

#define SYSCON_PLLCON_PLLC                  (0)                  /* Bit does not exist in LPC178x/40xx family */
#define SYSCON_PLL0STAT_PLLE                SYSCON_PLLSTAT_PLLE  /* PLL enable readback */
#define SYSCON_PLL0STAT_PLLC                SYSCON_PLLSTAT_PLLC  /* PLL connect readback */
#define SYSCON_PLL0STAT_PLOCK               SYSCON_PLLSTAT_PLOCK /* PLL lock status */
#define SYSCON_PLL1STAT_PLLE                SYSCON_PLLSTAT_PLLE  /* PLL enable readback */
#define SYSCON_PLL1STAT_PLLC                SYSCON_PLLSTAT_PLLC  /* PLL connect readback */
#define SYSCON_PLL1STAT_PLOCK               SYSCON_PLLSTAT_PLOCK /* PLL lock status */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC178X_SYSCON_H */
